      *--------------------------------------------------------------*
      * CONSULTA DE DOCUMENTOS PENDIENTES COMO ACEPTANTE             *
      * CABECERA                                                     *
      * FORMATO : BS4A                                               *
      *--------------------------------------------------------------*
      * MODIFICACIONES                                               *
      * PETICION  FECHA   AUTOR    DESCRIPCION                       *
      *--------------------------------------------------------------*
      *
       01 BS4A-DIECBS4A.
          05 BS4A-FORMATO                     PIC  X(08).
          05 BS4A-IND-PAGINACION              PIC  X(01).
          05 BS4A-ARG-BUSQUEDA                PIC  X(50).
