000100*----------------------------------------------------------------*00010000
000200*   DIECBE35 - FORMATO DE ENTRADA DE PRE-LIQ LETRAS/FACTURAS     *00020004
000300******************************************************************00030000
000400*        L O G    D E   M O D I F I C A C I O N E S              *00040000
000500******************************************************************00050000
000600* N° PETICION  FECHA    AUTOR    DESCRIPCION                     *00060000
000700* ----------- -------- -------- ----------------------------------00070000
001000******************************************************************00100000
001100 01  BE35-DIECBE35.                                               00110004
001101     05 BE35-USUARIO               PIC X(08).                     00110104
001102     05 BE35-INDINT                PIC X(01).                     00110204
001103     05 BE35-INDCAN                PIC X(01).                     00110304
001104     05 BE35-BCODAUX               PIC X(01).                     00110404
001110     05 BE35-DATOS-CARTERA OCCURS 100 TIMES.                      00111004
001200        10 BE35-COD-CARTERA        PIC X(12).                     00120004
001300        10 BE35-NUMBCO             PIC X(10).                     00130004
