      *--------------------------------------------------------------*
      * DIECBD3K : COPY DE FORMATO DE SALIDA BS3K                    *
      *            CONSULTA DE DOCUMENTOS                            *
      *--------------------------------------------------------------*
      *--------------------------------------------------------------*
      *
       01 BD3K-DIECBD3K.
          05 BD3K-DETALLE.
             10 BD3K-FORMATO                   PIC  X(08).
             10 BD3K-FECH-VENC                 PIC  X(10).
             10 BD3K-NUM-DOCUM                 PIC  X(10).
             10 BD3K-NOMB-ACEPT                PIC  X(40).
             10 BD3K-IMPORTE                   PIC  S9(13)V9(02).
             10 BD3K-SITUACION                 PIC  X(03).
             10 BD3K-NRORIGINAL                PIC  X(12).
      *
