      *--------------------------------------------------------------*
      * CONSULTA DE DOCUMENTOS PENDIENTES COMO ACEPTANTE             *
      * DETALLE                                                      *
      * FORMATO : BD4A                                               *
      *--------------------------------------------------------------*
      * MODIFICACIONES                                               *
      * PETICION  FECHA   AUTOR    DESCRIPCION                       *
      *--------------------------------------------------------------*
      *
       01 BD4A-DIECBD4A.
           05 BD4A-FORMATO                     PIC  X(08).
           05 BD4A-CODCAR                      PIC S9(12).
           05 BD4A-NRODOC                      PIC  X(10).
           05 BD4A-FECVEN                      PIC  X(10).
           05 BD4A-NOMBRE                      PIC  X(40).
           05 BD4A-IMPORTE                     PIC S9(15)V9(02).
           05 BD4A-TIPO                        PIC  X(01).
           05 BD4A-NRORIG                      PIC  X(12).
           05 BD4A-SITUAC                      PIC  X(01).
